OdGePoint2d.set(System.Double,System.Double)
\details
Sets this point to the specified X and Y coordinates.
Returns a reference to this point.
\param xx [in]  The X-coordinate of this point.
\param yy [in]  The Y-coordinate of this point.

OdGePoint2d.op_Subscript(System.UInt32)
\details
Returns ith coordinate of this point.
\param i [in]  Index of coordinate.
\remarks
* 0 returns the X-coordinate.
* 1 returns the Y-coordinate.
\details
References ith coordinate of this point.
\param i [in]  Index of coordinate.
\remarks
* 0 references the X-coordinate.
* 1 references the Y-coordinate.

OdGePoint2d.isEqualTo(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the distance from this point to point is within the
specified tolerance.
\param point [in]  Any 2D point.
\param tol [in]  Geometric tolerance.

OdGePoint2d.op_Inequality(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator. Returns true if any of the coordinates of this point are not equal to the corresponding coordinates
of the specified point.
\param point [in] A 2D point to be checked for inequality with this point.

OdGePoint2d.op_Equality(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Equality operator. Returns true if all the coordinates of this point are equal to the corresponding coordinates
of the specified point.
\param point [in] A 2D point to be checked for equality with this point.

OdGePoint2d.distanceSqrdTo(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the squared distance from this point to the specified point.
\param point [in]  Any 2D point to which a squared distance is measured.

OdGePoint2d.distanceTo(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the distance from this point to the specified point.
\param point [in]  Any 2D point to which a distance is measured.

OdGePoint2d.asVector
\details
Returns this point as a vector.
\details
Returns this point as a vector.

OdGePoint2d.op_Subtraction(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGePoint2d class.
\param point [in]  Input 2D point, coordinates of which are subtracted from the coordinates of this point.
\remarks
Returns a vector formed as a result of this point's coordinates minus coordinates of the specified point.

OdGePoint2d.setToSum(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this point to point + vect, and returns a reference to this point.
\param point [in]  Any 2D point.
\param vect [in]  A 2D vector.

OdGePoint2d.op_SubtractionAssignment(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGePoint2d class.
\param vect [in]  Input vector by which a point is translated.
\remarks
Returns a reference to the point equal to this point translated by the vector opposite to the specified vector.

OdGePoint2d.op_Subtraction(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGePoint2d class.
\param vect [in]  Input vector by which a point is translated.
\remarks
Returns a point that is translated in the opposite direction and length of the specified input vector.

OdGePoint2d.op_AdditionAssignment(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Addition operator for the OdGePoint2d class.
\param vect [in]  Input vector by which a point is translated.
\remarks
Returns a 2D point that is translated by the specified input vector.

OdGePoint2d.op_Addition(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Addition operator for the OdGePoint2d class.
\param vect [in]  Input vector by which a point is translated.
\remarks
Translates this point by the specified vector.

OdGePoint2d.op_DivisionAssignment(System.Double)
\details
Division operator for the OdGePoint2d class.
\param scale [in]  Input scale factor.
\remarks
Returns a reference to a point that is the result of scaling this point with respect to the origin by a scale factor.

OdGePoint2d.op_Division(System.Double)
\details
Division operator for the OdGePoint2d class.
\param scale [in]  Input scale factor.
\remarks
Returns the point equal to this point scaled by a scale factor 1/scale.

OdGePoint2d.op_MultiplicationAssignment(System.Double)
\details
Multiplication operator for the OdGePoint2d class.
\param scale [in]  Input scale factor.
\remarks
Scales this point by a scale factor. Returns the reference to this point.

OdGePoint2d.op_Multiply(System.Double)
\details
Multiplication operator for the OdGePoint2d class.
\param scale [in]  Input scale factor.
\remarks
Makes this point equal to the point scaled by a scale factor.

OdGePoint2d.scaleBy(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Scales this point by the scale factor about the basepoint.
\param scaleFactor [in]  Scale Factor. The scale factor must be greater than zero.
\param basePoint [in]  Basepoint relative to which scaling is computed.

OdGePoint2d.mirror(OdGeLine2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Mirrors this point about the specified 2D line.
\param line [in]  Mirror Line.

OdGePoint2d.rotateBy(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Rotates this point about the specified basePoint by the specified angle.
\param angle [in]  Rotation angle in radians.
\param basePoint [in]  Basepoint relative to which rotation is computed.

OdGePoint2d.transformBy(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this point to the result of the matrix multiplication of xfm * this point.
Returns a reference to this point.
\param xfm [in]  A 2D matrix with which this point is multiplied.

OdGePoint2d.setToProduct(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this point to the result of the matrix multiplication (matrix * point).
Returns a reference to this point.
\param matrix [in]  A 2D matrix with which a specified point is multiplied.
\param point [in]  The point to be multiplied.

OdGePoint2d.op_Multiply(System.Double,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Sets this point to the result of the matrix multiplication of the point and a scale factor.
\param scale [in]  Scale factor.
\param point [in]  The point to be multiplied.

OdGePoint2d.#ctor(System.Double,System.Double)
\details
Constructor for the OdGePoint2d class.
\param xx [in]  The X-coordinate of this point.
\param yy [in]  The Y-coordinate of this point.
\remarks
Constructs a 2D point with specified coordinates.

OdGePoint2d.#ctor
\details
Default constructor for the OdGePoint2d class.
\remarks
The default constructor constructs a point at the origin.